#include <iostream>

using namespace std;

// LeetCode #136. Single Number
//
// Условие:
// В массиве все числа встречаются ровно два раза, кроме одного — оно
// встречается один раз. Найди это число.
//
// Пример:
// Ввод: 4 1 2 1 2
// Вывод: 4
//
// Ограничения:
//
//     Массив содержит нечётное число элементов (от 1 до 101)
//     Все числа целые
//

int main() {
  cout << "Hello!";
  // const int SIZE = 50;
  // int a[SIZE];
  // int j = 0;
  // a[j] = 1;
  //
  // for (int i = 3; i <= 101; i++) {
  //   if (i % 2 == 1) {
  //     a[j++] = i;
  //   }
  // }
  //
  // for (int i = 0; i <= SIZE; i++) {
  //   cout << a[i] << endl;
  // }

  return 0;
}
